//----------------------------------------------------------------------------------
//
//----------------------------------------------------------------------------------
#include <windows.h>

#define ATS_WINDOWS
#include <Artemis.hpp>
using namespace Artemis;

//----------------------------------------------------------------------------------
//
//----------------------------------------------------------------------------------
int32_t WINAPI WinMain(HINSTANCE, HINSTANCE, LPSTR, int32_t)
{
	return Core::Bootup(
		L"Artemis.Sample",	// アプリケーション名
		SizeI(1280, 720),	// スクリーンサイズ
		60,					// フレームレート
		[]					// メイン関数
		{
			// メインループ
			while (Core::Update())
			{
			}

			return true;
		});
}
